# Series object with List

In [3]:
import pandas as pd

In [4]:
s1 = pd.Series([1,2,3,4,5])

In [6]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#With user defined Index

s1 = pd.Series([1,2,3],index=['a','b','c'])

In [8]:
s1

a    1
b    2
c    3
dtype: int64

# series object with Dictionary

In [11]:
s2 = pd.Series({'a':10,'b':20,'c':30})
s2

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series({'a':10,'b':20,'c':30},index=('a','d','b','c'))

a    10.0
d     NaN
b    20.0
c    30.0
dtype: float64

In [14]:
#Extracting element from series is same as python string
# can think about arithmetic in Series like s1+1 ans s1+s2 and all

#  DataFrames

In [15]:
pd.DataFrame({'name':['vishal','kevin',],'age':[10,20]})

     name  age
0  vishal   10
1   kevin   20

In [24]:
df = pd.read_csv('iris.csv')

In [25]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [26]:
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [31]:
df.shape

(150, 5)

In [29]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [33]:
#Get number of rows and columns
df.iloc[0:3,0:2]

   sepal.length  sepal.width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [34]:
df.loc[1:10,("sepal.length","sepal.width")]

    sepal.length  sepal.width
1            4.9          3.0
2            4.7          3.2
3            4.6          3.1
4            5.0          3.6
5            5.4          3.9
6            4.6          3.4
7            5.0          3.4
8            4.4          2.9
9            4.9          3.1
10           5.4          3.7

#  Function in Pandas

In [35]:
def makedouble(s):
    return s*2

In [37]:
df[["sepal.length"]].apply(makedouble)

     sepal.length
0            10.2
1             9.8
2             9.4
3             9.2
4            10.0
..            ...
145          13.4
146          12.6
147          13.0
148          12.4
149          11.8

[150 rows x 1 columns]

In [39]:
df['variety'].value_counts()

Setosa        50
Versicolor    50
Virginica     50
Name: variety, dtype: int64

In [40]:
df.sort_values(by='sepal.width')

     sepal.length  sepal.width  petal.length  petal.width     variety
60            5.0          2.0           3.5          1.0  Versicolor
62            6.0          2.2           4.0          1.0  Versicolor
119           6.0          2.2           5.0          1.5   Virginica
68            6.2          2.2           4.5          1.5  Versicolor
41            4.5          2.3           1.3          0.3      Setosa
..            ...          ...           ...          ...         ...
16            5.4          3.9           1.3          0.4      Setosa
14            5.8          4.0           1.2          0.2      Setosa
32            5.2          4.1           1.5          0.1      Setosa
33            5.5          4.2           1.4          0.2      Setosa
15            5.7          4.4           1.5          0.4      Setosa

[150 rows x 5 columns]